tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/wallBoiling1D_3phase/0.orig/epsilon.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    inlet
    {
        type            mapped;
        field           epsilon.liquid;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           uniform 0.001;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 0.00015;
        value           uniform 0.001;
    }

    wall1
    {
        type            epsilonWallFunction;
        value           uniform 0.001;
    }

    wall2
    {
        type            epsilonWallFunction;
        value           uniform 0.001;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
